RT-Thread/rt-thread/bsp/nxp/S32K3/S32K344/libraries/BaseNXP_TS_T40D34M50I0R0/header/S32K344_SCB.h
#define S32_SCB_ID_ISAR_ID_ISAR4_WIDTH           32u
#define S32_SCB_ID_ISAR_ID_ISAR4(x)              (((uint32_t)(((uint32_t)(x))<<S32_SCB_ID_ISAR_ID_ISAR4_SHIFT))&S32_SCB_ID_ISAR_ID_ISAR4_MASK)
/* CLIDR Bit Fields */
#define S32_SCB_CLIDR_CLIDR_MASK                 0xFFFFFFFFu
#define S32_SCB_CLIDR_CLIDR_SHIFT                0u
#define S32_SCB_CLIDR_CLIDR_WIDTH                32u
#define S32_SCB_CLIDR_CLIDR(x)                   (((uint32_t)(((uint32_t)(x))<<S32_SCB_CLIDR_CLIDR_SHIFT))&S32_SCB_CLIDR_CLIDR_MASK)
/* CTR Bit Fields */
#define S32_SCB_CTR_CTR_MASK                     0xFFFFFFFFu
#define S32_SCB_CTR_CTR_SHIFT                    0u
#define S32_SCB_CTR_CTR_WIDTH                    32u
#define S32_SCB_CTR_CTR(x)                       (((uint32_t)(((uint32_t)(x))<<S32_SCB_CTR_CTR_SHIFT))&S32_SCB_CTR_CTR_MASK)
/* CCSIDR Bit Fields */
#define S32_SCB_CCSIDR_CCSIDR_MASK               0xFFFFFFFFu
#define S32_SCB_CCSIDR_CCSIDR_SHIFT              0u
#define S32_SCB_CCSIDR_CCSIDR_WIDTH              32u
#define S32_SCB_CCSIDR_CCSIDR(x)                 (((uint32_t)(((uint32_t)(x))<<S32_SCB_CCSIDR_CCSIDR_SHIFT))&S32_SCB_CCSIDR_CCSIDR_MASK)
/* CSSELR Bit Fields */
#define S32_SCB_CSSELR_CSSELR_MASK               0xFFFFFFFFu
#define S32_SCB_CSSELR_CSSELR_SHIFT              0u
#define S32_SCB_CSSELR_CSSELR_WIDTH              32u
#define S32_SCB_CSSELR_CSSELR(x)                 (((uint32_t)(((uint32_t)(x))<<S32_SCB_CSSELR_CSSELR_SHIFT))&S32_SCB_CSSELR_CSSELR_MASK)
/* STIR Bit Fields */
#define S32_SCB_STIR_STIR_MASK                   0xFFFFFFFFu
#define S32_SCB_STIR_STIR_SHIFT                  0u
#define S32_SCB_STIR_STIR_WIDTH                  32u
#define S32_SCB_STIR_STIR(x)                     (((uint32_t)(((uint32_t)(x))<<S32_SCB_STIR_STIR_SHIFT))&S32_SCB_STIR_STIR_MASK)
/* FPCCR Bit Fields */
#define S32_SCB_FPCCR_FPCCR_MASK                 0xFFFFFFFFu
#define S32_SCB_FPCCR_FPCCR_SHIFT                0u
#define S32_SCB_FPCCR_FPCCR_WIDTH                32u
#define S32_SCB_FPCCR_FPCCR(x)                   (((uint32_t)(((uint32_t)(x))<<S32_SCB_FPCCR_FPCCR_SHIFT))&S32_SCB_FPCCR_FPCCR_MASK)
/* FPCAR Bit Fields */
#define S32_SCB_FPCAR_FPCAR_MASK                 0xFFFFFFFFu
#define S32_SCB_FPCAR_FPCAR_SHIFT                0u
#define S32_SCB_FPCAR_FPCAR_WIDTH                32u
#define S32_SCB_FPCAR_FPCAR(x)                   (((uint32_t)(((uint32_t)(x))<<S32_SCB_FPCAR_FPCAR_SHIFT))&S32_SCB_FPCAR_FPCAR_MASK)
/* FPDSCR Bit Fields */
#define S32_SCB_FPDSCR_FPDSCR_MASK               0xFFFFFFFFu
#define S32_SCB_FPDSCR_FPDSCR_SHIFT              0u
#define S32_SCB_FPDSCR_FPDSCR_WIDTH              32u
#define S32_SCB_FPDSCR_FPDSCR(x)                 (((uint32_t)(((uint32_t)(x))<<S32_SCB_FPDSCR_FPDSCR_SHIFT))&S32_SCB_FPDSCR_FPDSCR_MASK)
/* ICIALLU Bit Fields */
#define S32_SCB_ICIALLU_ICIALLU_MASK             0xFFFFFFFFu
#define S32_SCB_ICIALLU_ICIALLU_SHIFT            0u
#define S32_SCB_ICIALLU_ICIALLU_WIDTH            32u
#define S32_SCB_ICIALLU_ICIALLU(x)               (((uint32_t)(((uint32_t)(x))<<S32_SCB_ICIALLU_ICIALLU_SHIFT))&S32_SCB_ICIALLU_ICIALLU_MASK)
/* ICIMVAU Bit Fields */
#define S32_SCB_ICIMVAU_ICIMVAU_MASK             0xFFFFFFFFu
#define S32_SCB_ICIMVAU_ICIMVAU_SHIFT            0u
#define S32_SCB_ICIMVAU_ICIMVAU_WIDTH            32u
#define S32_SCB_ICIMVAU_ICIMVAU(x)               (((uint32_t)(((uint32_t)(x))<<S32_SCB_ICIMVAU_ICIMVAU_SHIFT))&S32_SCB_ICIMVAU_ICIMVAU_MASK)
/* DCIMVAC Bit Fields */
#define S32_SCB_DCIMVAC_DCIMVAC_MASK             0xFFFFFFFFu
#define S32_SCB_DCIMVAC_DCIMVAC_SHIFT            0u
#define S32_SCB_DCIMVAC_DCIMVAC_WIDTH            32u
#define S32_SCB_DCIMVAC_DCIMVAC(x)               (((uint32_t)(((uint32_t)(x))<<S32_SCB_DCIMVAC_DCIMVAC_SHIFT))&S32_SCB_DCIMVAC_DCIMVAC_MASK)
/* DCISW Bit Fields */
#define S32_SCB_DCISW_DCISW_MASK                 0xFFFFFFFFu
#define S32_SCB_DCISW_DCISW_SHIFT                0u
#define S32_SCB_DCISW_DCISW_WIDTH                32u
#define S32_SCB_DCISW_DCISW(x)                   (((uint32_t)(((uint32_t)(x))<<S32_SCB_DCISW_DCISW_SHIFT))&S32_SCB_DCISW_DCISW_MASK)
/* DCCMVAU Bit Fields */
#define S32_SCB_DCCMVAU_DCCMVAU_MASK             0xFFFFFFFFu
#define S32_SCB_DCCMVAU_DCCMVAU_SHIFT            0u
#define S32_SCB_DCCMVAU_DCCMVAU_WIDTH            32u
#define S32_SCB_DCCMVAU_DCCMVAU(x)               (((uint32_t)(((uint32_t)(x))<<S32_SCB_DCCMVAU_DCCMVAU_SHIFT))&S32_SCB_DCCMVAU_DCCMVAU_MASK)
/* DCCMVAC Bit Fields */
#define S32_SCB_DCCMVAC_DCCMVAC_MASK             0xFFFFFFFFu
#define S32_SCB_DCCMVAC_DCCMVAC_SHIFT            0u
#define S32_SCB_DCCMVAC_DCCMVAC_WIDTH            32u
#define S32_SCB_DCCMVAC_DCCMVAC(x)               (((uint32_t)(((uint32_t)(x))<<S32_SCB_DCCMVAC_DCCMVAC_SHIFT))&S32_SCB_DCCMVAC_DCCMVAC_MASK)
/* DCCSW Bit Fields */
#define S32_SCB_DCCSW_DCCSW_MASK                 0xFFFFFFFFu
#define S32_SCB_DCCSW_DCCSW_SHIFT                0u
#define S32_SCB_DCCSW_DCCSW_WIDTH                32u
#define S32_SCB_DCCSW_DCCSW(x)                   (((uint32_t)(((uint32_t)(x))<<S32_SCB_DCCSW_DCCSW_SHIFT))&S32_SCB_DCCSW_DCCSW_MASK)
/* DCCIMVAC Bit Fields */
#define S32_SCB_DCCIMVAC_DCCIMVAC_MASK           0xFFFFFFFFu
#define S32_SCB_DCCIMVAC_DCCIMVAC_SHIFT          0u
#define S32_SCB_DCCIMVAC_DCCIMVAC_WIDTH          32u
#define S32_SCB_DCCIMVAC_DCCIMVAC(x)             (((uint32_t)(((uint32_t)(x))<<S32_SCB_DCCIMVAC_DCCIMVAC_SHIFT))&S32_SCB_DCCIMVAC_DCCIMVAC_MASK)
/* DCCISW Bit Fields */
#define S32_SCB_DCCISW_DCCISW_MASK               0xFFFFFFFFu
#define S32_SCB_DCCISW_DCCISW_SHIFT              0u
#define S32_SCB_DCCISW_DCCISW_WIDTH              32u
#define S32_SCB_DCCISW_DCCISW(x)                 (((uint32_t)(((uint32_t)(x))<<S32_SCB_DCCISW_DCCISW_SHIFT))&S32_SCB_DCCISW_DCCISW_MASK)
/* BPIALL Bit Fields */
#define S32_SCB_BPIALL_BPIALL_MASK               0xFFFFFFFFu
#define S32_SCB_BPIALL_BPIALL_SHIFT              0u
#define S32_SCB_BPIALL_BPIALL_WIDTH              32u
#define S32_SCB_BPIALL_BPIALL(x)                 (((uint32_t)(((uint32_t)(x))<<S32_SCB_BPIALL_BPIALL_SHIFT))&S32_SCB_BPIALL_BPIALL_MASK)
/* ITCMCR Bit Fields */
#define S32_SCB_ITCMCR_ITCMCR_MASK               0xFFFFFFFFu
#define S32_SCB_ITCMCR_ITCMCR_SHIFT              0u
#define S32_SCB_ITCMCR_ITCMCR_WIDTH              32u
#define S32_SCB_ITCMCR_ITCMCR(x)                 (((uint32_t)(((uint32_t)(x))<<S32_SCB_ITCMCR_ITCMCR_SHIFT))&S32_SCB_ITCMCR_ITCMCR_MASK)
/* DTCMCR Bit Fields */
#define S32_SCB_DTCMCR_DTCMCR_MASK               0xFFFFFFFFu
#define S32_SCB_DTCMCR_DTCMCR_SHIFT              0u
#define S32_SCB_DTCMCR_DTCMCR_WIDTH              32u
#define S32_SCB_DTCMCR_DTCMCR(x)                 (((uint32_t)(((uint32_t)(x))<<S32_SCB_DTCMCR_DTCMCR_SHIFT))&S32_SCB_DTCMCR_DTCMCR_MASK)
/* AHBPCR Bit Fields */
#define S32_SCB_AHBPCR_AHBPCR_MASK               0xFFFFFFFFu
#define S32_SCB_AHBPCR_AHBPCR_SHIFT              0u
#define S32_SCB_AHBPCR_AHBPCR_WIDTH              32u
#define S32_SCB_AHBPCR_AHBPCR(x)                 (((uint32_t)(((uint32_t)(x))<<S32_SCB_AHBPCR_AHBPCR_SHIFT))&S32_SCB_AHBPCR_AHBPCR_MASK)
/* CACR Bit Fields */
#define S32_SCB_CACR_CACR_MASK                   0xFFFFFFFFu
#define S32_SCB_CACR_CACR_SHIFT                  0u
#define S32_SCB_CACR_CACR_WIDTH                  32u
#define S32_SCB_CACR_CACR(x)                     (((uint32_t)(((uint32_t)(x))<<S32_SCB_CACR_CACR_SHIFT))&S32_SCB_CACR_CACR_MASK)
/* AHBSCR Bit Fields */
#define S32_SCB_AHBSCR_AHBSCR_MASK               0xFFFFFFFFu
#define S32_SCB_AHBSCR_AHBSCR_SHIFT              0u
#define S32_SCB_AHBSCR_AHBSCR_WIDTH              32u
#define S32_SCB_AHBSCR_AHBSCR(x)                 (((uint32_t)(((uint32_t)(x))<<S32_SCB_AHBSCR_AHBSCR_SHIFT))&S32_SCB_AHBSCR_AHBSCR_MASK)
/* ABFSR Bit Fields */
#define S32_SCB_ABFSR_ABFSR_MASK                 0xFFFFFFFFu
#define S32_SCB_ABFSR_ABFSR_SHIFT                0u
#define S32_SCB_ABFSR_ABFSR_WIDTH                32u
#define S32_SCB_ABFSR_ABFSR(x)                   (((uint32_t)(((uint32_t)(x))<<S32_SCB_ABFSR_ABFSR_SHIFT))&S32_SCB_ABFSR_ABFSR_MASK)
/* IEBR0 Bit Fields */
#define S32_SCB_IEBR0_IEBR0_MASK                 0xFFFFFFFFu
#define S32_SCB_IEBR0_IEBR0_SHIFT                0u
#define S32_SCB_IEBR0_IEBR0_WIDTH                32u
#define S32_SCB_IEBR0_IEBR0(x)                   (((uint32_t)(((uint32_t)(x))<<S32_SCB_IEBR0_IEBR0_SHIFT))&S32_SCB_IEBR0_IEBR0_MASK)
/* IEBR1h Bit Fields */
#define S32_SCB_IEBR1h_IEBR1h_MASK               0xFFFFFFFFu
#define S32_SCB_IEBR1h_IEBR1h_SHIFT              0u
#define S32_SCB_IEBR1h_IEBR1h_WIDTH              32u
#define S32_SCB_IEBR1h_IEBR1h(x)                 (((uint32_t)(((uint32_t)(x))<<S32_SCB_IEBR1h_IEBR1h_SHIFT))&S32_SCB_IEBR1h_IEBR1h_MASK)
/* DEBR0h Bit Fields */
#define S32_SCB_DEBR0h_DEBR0h_MASK               0xFFFFFFFFu
#define S32_SCB_DEBR0h_DEBR0h_SHIFT              0u
#define S32_SCB_DEBR0h_DEBR0h_WIDTH              32u
#define S32_SCB_DEBR0h_DEBR0h(x)                 (((uint32_t)(((uint32_t)(x))<<S32_SCB_DEBR0h_DEBR0h_SHIFT))&S32_SCB_DEBR0h_DEBR0h_MASK)
/* DEBR1h Bit Fields */
#define S32_SCB_DEBR1h_DEBR1h_MASK               0xFFFFFFFFu
#define S32_SCB_DEBR1h_DEBR1h_SHIFT              0u
#define S32_SCB_DEBR1h_DEBR1h_WIDTH              32u
#define S32_SCB_DEBR1h_DEBR1h(x)                 (((uint32_t)(((uint32_t)(x))<<S32_SCB_DEBR1h_DEBR1h_SHIFT))&S32_SCB_DEBR1h_DEBR1h_MASK)
/* PID Bit Fields */
#define S32_SCB_PID_PID0_MASK                    0xFFFFFFFFu
#define S32_SCB_PID_PID0_SHIFT                   0u
#define S32_SCB_PID_PID0_WIDTH                   32u
#define S32_SCB_PID_PID0(x)                      (((uint32_t)(((uint32_t)(x))<<S32_SCB_PID_PID0_SHIFT))&S32_SCB_PID_PID0_MASK)
#define S32_SCB_PID_PID1_MASK                    0xFFFFFFFFu
#define S32_SCB_PID_PID1_SHIFT                   0u
#define S32_SCB_PID_PID1_WIDTH                   32u
#define S32_SCB_PID_PID1(x)                      (((uint32_t)(((uint32_t)(x))<<S32_SCB_PID_PID1_SHIFT))&S32_SCB_PID_PID1_MASK)
#define S32_SCB_PID_PID2_MASK                    0xFFFFFFFFu
#define S32_SCB_PID_PID2_SHIFT                   0u
#define S32_SCB_PID_PID2_WIDTH                   32u
#define S32_SCB_PID_PID2(x)                      (((uint32_t)(((uint32_t)(x))<<S32_SCB_PID_PID2_SHIFT))&S32_SCB_PID_PID2_MASK)
#define S32_SCB_PID_PID3_MASK                    0xFFFFFFFFu
#define S32_SCB_PID_PID3_SHIFT                   0u
#define S32_SCB_PID_PID3_WIDTH                   32u
#define S32_SCB_PID_PID3(x)                      (((uint32_t)(((uint32_t)(x))<<S32_SCB_PID_PID3_SHIFT))&S32_SCB_PID_PID3_MASK)
#define S32_SCB_PID_PID4_MASK                    0xFFFFFFFFu
#define S32_SCB_PID_PID4_SHIFT                   0u
#define S32_SCB_PID_PID4_WIDTH                   32u
#define S32_SCB_PID_PID4(x)                      (((uint32_t)(((uint32_t)(x))<<S32_SCB_PID_PID4_SHIFT))&S32_SCB_PID_PID4_MASK)
#define S32_SCB_PID_PID5_MASK                    0xFFFFFFFFu
#define S32_SCB_PID_PID5_SHIFT                   0u
#define S32_SCB_PID_PID5_WIDTH                   32u
#define S32_SCB_PID_PID5(x)                      (((uint32_t)(((uint32_t)(x))<<S32_SCB_PID_PID5_SHIFT))&S32_SCB_PID_PID5_MASK)
#define S32_SCB_PID_PID6_MASK                    0xFFFFFFFFu
#define S32_SCB_PID_PID6_SHIFT                   0u
#define S32_SCB_PID_PID6_WIDTH                   32u
#define S32_SCB_PID_PID6(x)                      (((uint32_t)(((uint32_t)(x))<<S32_SCB_PID_PID6_SHIFT))&S32_SCB_PID_PID6_MASK)
#define S32_SCB_PID_PID7_MASK                    0xFFFFFFFFu
#define S32_SCB_PID_PID7_SHIFT                   0u
#define S32_SCB_PID_PID7_WIDTH                   32u
#define S32_SCB_PID_PID7(x)                      (((uint32_t)(((uint32_t)(x))<<S32_SCB_PID_PID7_SHIFT))&S32_SCB_PID_PID7_MASK)
/* CID Bit Fields */
#define S32_SCB_CID_CID0_MASK                    0xFFFFFFFFu
#define S32_SCB_CID_CID0_SHIFT                   0u
#define S32_SCB_CID_CID0_WIDTH                   32u
#define S32_SCB_CID_CID0(x)                      (((uint32_t)(((uint32_t)(x))<<S32_SCB_CID_CID0_SHIFT))&S32_SCB_CID_CID0_MASK)
#define S32_SCB_CID_CID1_MASK                    0xFFFFFFFFu
#define S32_SCB_CID_CID1_SHIFT                   0u
#define S32_SCB_CID_CID1_WIDTH                   32u
#define S32_SCB_CID_CID1(x)                      (((uint32_t)(((uint32_t)(x))<<S32_SCB_CID_CID1_SHIFT))&S32_SCB_CID_CID1_MASK)
#define S32_SCB_CID_CID2_MASK                    0xFFFFFFFFu
#define S32_SCB_CID_CID2_SHIFT                   0u
#define S32_SCB_CID_CID2_WIDTH                   32u
#define S32_SCB_CID_CID2(x)                      (((uint32_t)(((uint32_t)(x))<<S32_SCB_CID_CID2_SHIFT))&S32_SCB_CID_CID2_MASK)
#define S32_SCB_CID_CID3_MASK                    0xFFFFFFFFu
#define S32_SCB_CID_CID3_SHIFT                   0u
#define S32_SCB_CID_CID3_WIDTH                   32u
#define S32_SCB_CID_CID3(x)                      (((uint32_t)(((uint32_t)(x))<<S32_SCB_CID_CID3_SHIFT))&S32_SCB_CID_CID3_MASK)

/*!
 * @}
 */ /* end of group S32_SCB_Register_Masks */

/*!
 * @}
 */ /* end of group S32_SCB_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K344_SCB_H_) */
